In [1]:
import pandas as pd

In [11]:
emp=pd.DataFrame({"eid":[101,102,103,104,105],
                            "name":["Ajay","Yuvi","Sunny","Abhi","Vaani"],
                  "salary":[185000,25000,20000,12000,195000]})

In [12]:
emp

   eid   name  salary
0  101   Ajay  185000
1  102   Yuvi   25000
2  103  Sunny   20000
3  104   Abhi   12000
4  105  Vaani  195000

In [4]:
dept_detailes=pd.DataFrame({"intake":[120, 60,120,60],
                            "admitted":[114,54,110,45],
                           }, index=["Mechanical","Electrical","Civil","Chemical"])

In [5]:
dept_detailes

            intake  admitted
Mechanical     120       114
Electrical      60        54
Civil          120       110
Chemical        60        45

### Add column or row

In [6]:
dept_detailes["vaccant"]=dept_detailes["intake"]-dept_detailes["admitted"]

In [7]:
dept_detailes

            intake  admitted  vaccant
Mechanical     120       114        6
Electrical      60        54        6
Civil          120       110       10
Chemical        60        45       15

In [13]:
emp["address"]=["gurugram","pune","solapur","solapur","solapur"]

In [14]:
emp

   eid   name  salary   address
0  101   Ajay  185000  gurugram
1  102   Yuvi   25000      pune
2  103  Sunny   20000   solapur
3  104   Abhi   12000   solapur
4  105  Vaani  195000   solapur

In [15]:
emp.loc[emp.shape[0]]=[106,"isha",190000,"kanpur"]

In [16]:
emp

   eid   name  salary   address
0  101   Ajay  185000  gurugram
1  102   Yuvi   25000      pune
2  103  Sunny   20000   solapur
3  104   Abhi   12000   solapur
4  105  Vaani  195000   solapur
5  106   isha  190000    kanpur

In [17]:
emp["gender"]=["M","M","M","M","F","F"]

In [18]:
emp

   eid   name  salary   address gender
0  101   Ajay  185000  gurugram      M
1  102   Yuvi   25000      pune      M
2  103  Sunny   20000   solapur      M
3  104   Abhi   12000   solapur      M
4  105  Vaani  195000   solapur      F
5  106   isha  190000    kanpur      F

In [19]:
student=pd.DataFrame({"rollno":[1, 2,3,4],
                            "name":["jai","vijay","sanjay","digvijay"],
                           })

In [20]:
student

   rollno      name
0       1       jai
1       2     vijay
2       3    sanjay
3       4  digvijay

In [22]:
student["gender"]=["M","M","M","M"]

In [24]:
student["marks"]=[78,88,72,52]

In [25]:
student

   rollno      name gender  marks
0       1       jai      M     78
1       2     vijay      M     88
2       3    sanjay      M     72
3       4  digvijay      M     52

### Drop column or row

In [27]:
student.drop("gender", axis=1)

   rollno      name  marks
0       1       jai     78
1       2     vijay     88
2       3    sanjay     72
3       4  digvijay     52

In [28]:
student

   rollno      name gender  marks
0       1       jai      M     78
1       2     vijay      M     88
2       3    sanjay      M     72
3       4  digvijay      M     52

In [30]:
student.drop("gender", axis=1,inplace=True)
student

   rollno      name  marks
0       1       jai     78
1       2     vijay     88
2       3    sanjay     72
3       4  digvijay     52

In [32]:
student.drop(3,inplace=True)
student

   rollno    name  marks
0       1     jai     78
1       2   vijay     88
2       3  sanjay     72

In [34]:
student.drop(["rollno","marks"],axis=1, inplace=True)
student

     name
0     jai
1   vijay
2  sanjay